print("Hello, World!") 		#На клавиатуре ищем подходящие кнопки для написания следующей фразы	"Hello, World!" (с англ. "Привет, Мир!") и передаем эту фразу в функцию print.

def fib(n):				#Здесь мы задаем функцию при помощи "def", далее прописываем название "fib", опять же, используя подходящие для этого кнопки, в скобках указываем локальную переменную, которая будет использоваться в этой функции.
	f1 = 0				#ЗДЕСЬ МЫ СОЗДАЕМ ТРИ ПЕРЕМЕННЫЕ: ПЕРВЫЕ ДВЕ ВСПОМОГАТЕЛЬНЫЕ А ТРЕТЬЯ - ТЕКУЩЕЕ ЧИСЛО
	f2 = 1
	fn = 1		
	if n >= 1:			#ДВЕ ПРОВЕРКИ С СООТВЕТСВЕННЫМ ВЫВОДОМ
		print(0)

	if n >= 2:
		print(1)

	for i in range(n-2): #СОЗДАЕМ ЦИКЛ ДЛЯ ВЫВОДА ЧИСЕЛ ФИБОНАЧЧИ 
		fn = f1 + f2
		print(fn)
		f1 = f2
		f2 = fn

fib(10)		#ВЫЗЫВАЕМ НАШУ ФУНКЦИЮ


