print("Hello, World!") 		#На клавиатуре ищем подходящие кнопки для написания следующей фразы	"Hello, World!" (с англ. "Привет, Мир!") и передаем эту фразу в функцию print.

def fib(n):				#Здесь мы задаем функцию при помощи "def", далее прописываем название "fib", опять же, используя подходящие для этого кнопки, в скобках указываем локальную переменную, которая будет использоваться в этой функции.
	if n == 0:			#Проверка первого условия: если локальная переменная оказалась равной нулю, тогда заставляем нашу функцию вернуть значение 0.
		return 0	
	if n == 1 or n == 2:	#Проверка второго условия: если локальная переменная оказалась равной единице или двойке, тогда заставляем нашу функцию вернуть значение 0.
		return 1 
	else:	#Проверка третьего условия. Else (с англ. иначе) проверяет соблюдение предыдущих условий, и, соотвественно, если условия не были соблюдены, тогда функция возвращает следующую картину: fib(n-1) + fib(n-2). Это рекурсия. Рекурсия подразумевает собой вызов функцией самой себя. 
		return fib(n-1) + fib(n-2)

print(fib(10))		#При помощи небезызвестной функции "print" мы заставляем нашу программу напечатать конечный возврат нашей функции "fib", при работе с данным числом 10.